trade/src/Catalogs/ПравилаИнтеграцииС1СДокументооборотом3/ПравилаИнтеграцииС1СДокументооборотом3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаИнтеграцииС1СДокументооборотом3</name>
  <attributes>
    <name>ВидДокументаДО</name>
    <comment>Заполнен, если тип объекта ДО DMDocument</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаДОID</name>
    <comment>Заполнен, если тип объекта ДО DMDocument</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЗагрузкиДанныхВДО</name>
    <comment>Идентификатор правила загрузки данных в 1С:Документооборот</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаДО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаДОСКлючевымиПолями</name>
    <comment>Представление объекта 1С:Документооборота вместе с ключевыми полями</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаИС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаИССКлючевымиПолями</name>
    <comment>Представление объекта потребителя вместе с ключевыми полями</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеРеквизитыДО</name>
    <attributes>
      <name>Имя</name>
      <comment>Имя ключевого реквизита объекта 1С:Документооборот</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизита</name>
      <comment>Значение ключевого реквизита объекта 1С:Документооборот</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаID</name>
      <comment>Идентификатор значения ключевого реквизита объекта 1С:Документооборот</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаТип</name>
      <comment>Имя типа значения ключевого реквизита объекта 1С:Документооборот</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДополнительныйРеквизитДО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КлючевыеРеквизитыИС</name>
    <attributes>
      <name>Имя</name>
      <comment>Имя ключевого реквизита объекта интегрированной системы</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизита</name>
      <comment>Значение ключевого реквизита объекта интегрированной системы</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДополнительныйРеквизитИС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаЗаполненияРеквизитовИС</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Вариант</name>
      <type>
        <types>EnumRef.ВариантыПравилЗаполненияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычисляемоеВыражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДОID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДОТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитИС</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаИС</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъектаДО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъектаИС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоВыполненияВыражения</name>
      <type>
        <types>EnumRef.МестаВыполненияВыраженийНаВстроенномЯзыке</types>
      </type>
    </attributes>
    <attributes>
      <name>Обновлять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимИзмененияДанныхПроведенногоДокумента</name>
      <type>
        <types>EnumRef.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота</types>
      </type>
    </attributes>
    <attributes>
      <name>Таблица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДополнительныйРеквизитДО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДополнительныйРеквизитИС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоТаблица</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/Catalogs/ПравилаИнтеграцииС1СДокументооборотом3/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ПроверитьВозможностьЗаписиПравила();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПредставление();
	
	ПроверитьНаличиеДублей();
	
	Для Каждого Строка Из ПравилаЗаполненияРеквизитовИС Цикл
		Если Не ЗначениеЗаполнено(Строка.id) Тогда
			Строка.id = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет представление правила согласно представлениям объектов и ключевых реквизитов.
//
Процедура ОбновитьПредставление()
	
	// Соберем представление объекта ИС.
	ПредставлениеОбъектаИС = "";
	ПредставлениеОбъектаИССКлючевымиПолями = "";
	
	МассивПолноеПредставлениеОбъектаИС = Новый Массив;
	
	ОбъектПотребителя = Метаданные.НайтиПоПолномуИмени(ТипОбъектаИС);
	Если ОбъектПотребителя <> Неопределено Тогда
		ПредставлениеОбъектаИС = ?(ОбъектПотребителя.Синоним = "",
			ОбъектПотребителя.Имя,
			ОбъектПотребителя.Синоним);
		
		МассивПолноеПредставлениеОбъектаИС.Добавить(ПредставлениеОбъектаИС);
		
		// Дополним представление ключевыми реквизитами.
		Для Каждого КлючевойРеквизит Из КлючевыеРеквизитыИС Цикл
			ПредставлениеКлючевогоРеквизита = ПредставлениеКлючевогоРеквизита(КлючевойРеквизит);
			Если ПредставлениеКлючевогоРеквизита <> "" Тогда
				МассивПолноеПредставлениеОбъектаИС.Добавить(ПредставлениеКлючевогоРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПредставлениеОбъектаИССКлючевымиПолями = СтрСоединить(МассивПолноеПредставлениеОбъектаИС, ", ");
	
	Если СокрЛП(Комментарий) <> "" Тогда
		// Комментарий не должен входить в ПредставлениеОбъектаИС, но должен входить в наименование.
		МассивПолноеПредставлениеОбъектаИС.Добавить(СокрЛП(Комментарий));
	КонецЕсли;
	
	// Соберем представление объекта ДО.
	МассивПредставлениеОбъектаДО = Новый Массив;
	МассивПредставлениеОбъектаДО.Добавить(ПредставлениеОбъектаДО);
	
	Для Каждого КлючевойРеквизит Из КлючевыеРеквизитыДО Цикл
		Если КлючевойРеквизит.Имя = "documentType" Тогда
			Продолжить;
		КонецЕсли;
		
		ПредставлениеКлючевогоРеквизита = ПредставлениеКлючевогоРеквизита(КлючевойРеквизит);
		Если ПредставлениеКлючевогоРеквизита <> "" Тогда
			МассивПредставлениеОбъектаДО.Добавить(ПредставлениеКлючевогоРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ПредставлениеОбъектаДОСКлючевымиПолями = СтрСоединить(МассивПредставлениеОбъектаДО, ", ");
	
	// Соберем наименование.
	Наименование = СтрШаблон("%1 - %2",
		СтрСоединить(МассивПолноеПредставлениеОбъектаИС, ", "),
		ПредставлениеОбъектаДОСКлючевымиПолями);
	
КонецПроцедуры

Функция ПредставлениеКлючевогоРеквизита(КлючевойРеквизит)
	
	Если ТипЗнч(КлючевойРеквизит.ЗначениеРеквизита) = Тип("Булево")
			Или ТипЗнч(КлючевойРеквизит.ЗначениеРеквизита) = Тип("Число")
			Или ТипЗнч(КлючевойРеквизит.ЗначениеРеквизита) = Тип("Дата") Тогда
		Возврат СтрШаблон("%1: %2", КлючевойРеквизит.Представление, СокрЛП(КлючевойРеквизит.ЗначениеРеквизита));
	Иначе
		Представление = СокрЛП(КлючевойРеквизит.ЗначениеРеквизита);
		Если Представление = "" Тогда
			Представление = СтрШаблон(НСтр("ru = '%1: пустое значение'"), КлючевойРеквизит.Представление);
		КонецЕсли;
		Возврат Представление;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьВозможностьЗаписиПравила()
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	ШаблоныВыражений =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ШаблоныВыраженийНаВстроенномЯзыке();
	
	СписокВыраженийДляЗаполненияРеквизитовИС = Новый Соответствие;
	Для Каждого Строка Из ПравилаЗаполненияРеквизитовИС Цикл
		Если ЗначениеЗаполнено(Строка.ВычисляемоеВыражение) Тогда
			ЭтоШаблон = Ложь;
			Для Каждого ШаблонВыражения Из ШаблоныВыражений Цикл
				Если ШаблонВыражения.Значение = Строка.ВычисляемоеВыражение Тогда
					ЭтоШаблон = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЭтоШаблон Тогда
				Продолжить;
			КонецЕсли;
			Ключ = Новый Структура("ИмяРеквизитаОбъектаИС, ЭтоТаблица, Таблица");
			ЗаполнитьЗначенияСвойств(Ключ, Строка);
			СписокВыраженийДляЗаполненияРеквизитовИС.Вставить(Ключ, Строка.ВычисляемоеВыражение);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокВыраженийДляЗаполненияРеквизитовИС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ВызватьИсключение НСтр("ru = 'В правилах интеграции с 1С:Документооборотом запрещено изменять выражения на встроенном языке.
			|Обратитесь к администратору.'");
	КонецЕсли;
	
	СтарыеПравилаЗаполненияРеквизитовИС =
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПравилаЗаполненияРеквизитовИС").Выгрузить();
	
	Для Каждого ТекущееВыражение Из СписокВыраженийДляЗаполненияРеквизитовИС Цикл
		Строки = СтарыеПравилаЗаполненияРеквизитовИС.НайтиСтроки(ТекущееВыражение.Ключ);
		Если Строки.Количество() = 1 И Строки[0].ВычисляемоеВыражение = ТекущееВыражение.Значение Тогда
			Продолжить;
		КонецЕсли;
		ВызватьИсключение НСтр("ru = 'В правилах интеграции с 1С:Документооборотом запрещено изменять выражения на встроенном языке.
			|Обратитесь к администратору.'");
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеДублей()
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	КлючевыеРеквизитыИСКолонки = "Имя, ЗначениеРеквизита";
	ТекущиеКлючевыеРеквизитыИС = КлючевыеРеквизитыИС.Выгрузить(, КлючевыеРеквизитыИСКолонки);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПравилаИнтеграцииС1СДокументооборотом3.Ссылка КАК Ссылка,
		|	ПравилаИнтеграцииС1СДокументооборотом3.КлючевыеРеквизитыИС КАК КлючевыеРеквизитыИС
		|ИЗ
		|	Справочник.ПравилаИнтеграцииС1СДокументооборотом3 КАК ПравилаИнтеграцииС1СДокументооборотом3
		|ГДЕ
		|	ПравилаИнтеграцииС1СДокументооборотом3.Ссылка <> &Ссылка
		|	И ПравилаИнтеграцииС1СДокументооборотом3.ТипОбъектаИС = &ТипОбъектаИС
		|	И НЕ ПравилаИнтеграцииС1СДокументооборотом3.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипОбъектаИС", ТипОбъектаИС);
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"ПравилаИнтеграцииС1СДокументооборотом3.КлючевыеРеквизитыИС",
		СтрШаблон("ПравилаИнтеграцииС1СДокументооборотом3.КлючевыеРеквизитыИС.(%1)", КлючевыеРеквизитыИСКолонки));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ОбщегоНазначения.КоллекцииИдентичны(ТекущиеКлючевыеРеквизитыИС, Выборка.КлючевыеРеквизитыИС.Выгрузить()) Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Правило интеграции объекта ""%1"" уже существует.
					|Для создания еще одного правила требуется изменить набор ключевых реквизитов.'"),
				ПредставлениеОбъектаИССКлючевымиПолями);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
